# 5.3 Data Stacking and Unstacking

### 5.3-Data-Stacking-and-Unstacking_Matthew-Pergolski

In [9]:
notyetdf = {'person':['Jeff','Geoff','Jeffrey'],'age':[15,25,35],'weight':[120,180,195]}
notyetdf

{'person': ['Jeff', 'Geoff', 'Jeffrey'],
 'age': [15, 25, 35],
 'weight': [120, 180, 195]}

In [10]:
import pandas as pd

df = pd.DataFrame(notyetdf)
df

    person  age  weight
0     Jeff   15     120
1    Geoff   25     180
2  Jeffrey   35     195

In [11]:
#1 | Reset index

df.set_index('person')

         age  weight
person
Jeff      15     120
Geoff     25     180
Jeffrey   35     195

In [12]:
# 2 | Stack into Tall object

df.stack()

0  person       Jeff
   age            15
   weight        120
1  person      Geoff
   age            25
   weight        180
2  person    Jeffrey
   age            35
   weight        195
dtype: object

In [16]:
#3 | Reset Index

df.reset_index()

   index   person  attribute  value
0      0     Jeff         15    120
1      1    Geoff         25    180
2      2  Jeffrey         35    195

In [15]:
#4 | Rename Columns

df.columns=[ 'person', 'attribute', 'value']
df

    person  attribute  value
0     Jeff         15    120
1    Geoff         25    180
2  Jeffrey         35    195

In [17]:
#5 | Unstack

df.unstack()

person     0       Jeff
           1      Geoff
           2    Jeffrey
attribute  0         15
           1         25
           2         35
value      0        120
           1        180
           2        195
dtype: object

In [20]:
#6 | Pivot

df.pivot('person', 'attribute', 'value')

attribute     15     25     35
person
Geoff        NaN  180.0    NaN
Jeff       120.0    NaN    NaN
Jeffrey      NaN    NaN  195.0

In [ ]:
>>> import pandas as pd
>>> persondict = {'person':['Bob','Alice','Steve'],'age':[32,24,64],'weight':[128,86,95]} >>> persontable=pd.DataFrame(persondict, columns=['person','age','weight'])
>>> persontable
person age weight
0 Bob 32 128
1 Alice 24 86
2 Steve 64 95
>>> persontable = persontable.set_index('person') >>> persontable
age weight person
Bob 32 128 Alice 24 86 Steve 64 95
>>> result = persontable.stack() >>> result
person
Bob age 32
weight 128 Alice age 24
weight 86 Steve age 64
weight 95 dtype: int64
>>> persontall = result.reset_index() >>> persontall
person level_1 0
0 Bob age 32
1 Bob weight 128
2 Alice age 24
3 Alice weight 86
4 Steve age 64
5 Steve weight 95
>>> persontall.columns=['person','attribute','value'] >>> persontall
person attribute value 0 Bob age 32
1 Bob weight 128 2Alice age 24
3 Alice weight 86 4Steve age 64 5 Steve weight 95 >>> result.unstack()
age weight person
Bob 32 128
Alice 24 86
Steve 64 95
>>> persontall.pivot('person','attribute','value') attribute age weight
person Alice Bob Steve
24 86 32 128 64 95